{
    "intents": [
        {
            "tag": "greetings",
            "patterns": ["hello", "hi", "hey", "good day", "what's up?"],
            "responses": ["Hello!", "Hey", "What can I do for you?"]
        },
        {
            "tag": "goodbye",
            "patterns": ["see you later", "goodbye", "I am leaving", "bye", "talk to you later"],
            "responses": ["Sad to see you go", "Have a great day", "Goodbye"]
        },
        {
            "tag": "age",
            "patterns": ["what is your Age?", "how old are you?", "age?", "how old?"],
            "responses": ["My creator Pratik is 21 years old.", "21 years old"]
        },
        {
            "tag": "name",
            "patterns": ["what is your name", "what should I call you", "who are you", "can you tell me your name"],
            "responses": ["You can call me Neural.", "I am Neural.", "I am Pratik's assistant Neural."]
        },
        {
            "tag": "common cold symptoms",
            "patterns": ["I have a runny or stuffy nose", "I have a sore throat", "I have a cough", "I have congestion", "I have body aches or a mild headache", "I have sneezing", "I have a low-grade fever", "I feel generally unwell"],
            "responses": ["It seems that you are suffering from the common cold."]
        },
        {
            "tag": "fever symptoms",
            "patterns": ["I have sweating", "I have chills and shivering", "I have a headache", "I have muscle aches", "I have loss of appetite", "I have irritability", "I have dehydration", "I have general weakness"],
            "responses": ["It seems that you are suffering from fever."]
        },
        {
            "tag": "diabetes symptoms",
            "patterns": ["I have increased hunger", "I have increased thirst", "I have weight loss", "I have frequent urination", "I have blurry vision", "I have extreme fatigue"],
            "responses": ["It seems that you are suffering from diabetes."]
        },
        {
            "tag": "depression symptoms",
            "patterns": ["I have a hopeless outlook", "I have lost interest", "I have increased fatigue", "I have sleep problems", "I have anxiety", "I have a change in weight", "I have thoughts of death"],
            "responses": ["It seems that you are suffering from depression."]
        },
        {
            "tag": "asthma symptoms",
            "patterns": ["I have coughing", "I have tightness in the chest", "I have shortness of breath", "I have difficulty talking", "I have panic", "I have fatigue"],
            "responses": ["It seems that you are suffering from asthma."]
        },
        {
            "tag": "common cold prevention",
            "patterns": ["What medicines can I buy for the common cold?", "Tell me some prevention methods for the common cold.", "What should I eat or drink if I have a common cold?", "How can I prevent getting a cold or the flu?"],
            "responses": ["Medicines you can consume: Dextromethorphan, Decongestant, Diphenhydramine, Crocin Cold & Flu Max. Preventive measures: Wash your hands, avoid touching your face, clean frequently used surfaces, use hand sanitizers. Suggested foods: Garlic, Vitamin C-containing fruits, Leafy greens, Broccoli, Oatmeal, Spices, Chicken Soup."]
        },
        {
            "tag": "fever prevention",
            "patterns": ["What medicines can I buy for fever?", "Tell me some prevention methods for fever.", "What should I eat or drink if I have a fever?", "How can I prevent getting a fever?"],
            "responses": ["Medicines you can consume: Acetaminophen, Ibuprofen, Aspirin, Crocin Cold & Flu Max. Preventive measures: Wash your hands, cover your mouth when you cough and your nose when you sneeze, clean frequently used surfaces, avoid sharing cups, glasses, and eating utensils with other people. Suggested foods: Garlic, Vitamin C-containing fruits, Leafy greens, Broccoli, Oatmeal, Spices, Chicken Soup."]
        },
        {
            "tag": "diabetes prevention",
            "patterns": ["What medicines can I buy for diabetes?", "Tell me some prevention methods for diabetes.", "What should I eat or drink if I have diabetes?", "How can I prevent getting diabetes?"],
            "responses": ["Medicines you can consume: Insulin, Amylinomimetic drug, Dipeptidyl peptidase-4 (DPP-4) inhibitor. Preventive measures: Cut sugar and refined carbs from your diet, work out regularly, drink water as your primary beverage, lose weight if you’re overweight or obese, quit smoking. Suggested foods: Leafy greens, Avocados, Eggs."]
        },
        {
            "tag": "depression prevention",
            "patterns": ["What medicines can I buy for depression?", "Tell me some prevention methods for depression.", "What should I eat or drink if I have depression?", "How can I prevent getting depression?"],
            "responses": ["Medicines you can consume: Brexpiprazole, Quetiapine, Olanzapine. Preventive measures: Exercise regularly, cut back on social media time, drink water as your primary beverage, build strong relationships, minimize your daily choices. Suggested foods: Get enough Vitamin D, include Omega-3 Fatty Acids, beans and legumes."]
        },
        {
            "tag": "asthma prevention",
            "patterns": ["What medicines can I buy for asthma?", "Tell me some prevention methods for asthma.", "What should I eat or drink if I have asthma?", "How can I prevent getting asthma?"],
            "responses": ["Medicines you can consume: Epinephrine, Anticholinergic, Proair HFA. Preventive measures: Identify asthma triggers, stay away from allergens, avoid smoke of any type. Suggested foods: Carrots, juice, eggs, broccoli, cantaloupe, milk."]
        },
        {
            "tag": "consultation",
            "patterns": ["Who should I contact for consultation?", "Is there any doctor available?", "Can you give me some suggestions for doctor consultations?", "Can you set up a meeting with a doctor for consultation?", "Is there any doctor available for consultation?"],
            "responses": ["You can contact various doctors for consultation: 1. [1mg Online Doctor Consultation](https://www.1mg.com/online-doctor-consultation), 2. [Tata Health General Physician Consultation](https://www.tatahealth.com/online-doctor-consultation/general-physician), 3. [DocOnline](https://www.doconline.com/). Alternatively, you can visit your local doctor or family physician."]
        }
        {
            "tag": "exercise",
            "patterns": ["What exercises can help with common cold?", "How can I stay active during a fever?", "What are some exercises for diabetes management?", "What type of exercise is good for depression?", "Can exercise help with asthma?"],
            "responses": ["For common cold: Gentle activities like walking. For fever: Rest is important, but light stretching can help if you feel up to it. For diabetes: Aerobic exercises like walking or cycling. For depression: Regular exercise like jogging or yoga. For asthma: Breathing exercises and moderate aerobic activities."]
        },
        {
            "tag": "hydration",
            "patterns": ["How much water should I drink when I have a cold?", "What is the best way to stay hydrated during a fever?", "How does hydration affect diabetes?", "Can drinking water help with depression?", "How important is hydration for asthma?"],
            "responses": ["For cold: Drink plenty of fluids, including water, herbal teas, and broths. For fever: Stay hydrated with water and clear fluids. For diabetes: Monitor your fluid intake and opt for water. For depression: Proper hydration can improve mood. For asthma: Keep hydrated to help with mucus clearance."]
        },
        {
            "tag": "diet",
            "patterns": ["What foods should I eat for common cold?", "What diet is recommended during a fever?", "What is a good diet for managing diabetes?", "What are some recommended foods for someone with depression?", "Can diet affect asthma symptoms?"],
            "responses": ["For cold: Eat nutrient-rich foods like fruits, vegetables, and soups. For fever: Light, easily digestible foods like crackers and broth. For diabetes: Focus on balanced meals with whole grains, lean proteins, and healthy fats. For depression: Foods rich in Omega-3 fatty acids, vitamins, and minerals. For asthma: Avoid allergens and focus on anti-inflammatory foods."]
        },
        {
            "tag": "emergency",
            "patterns": ["What should I do in case of an asthma attack?", "How to handle a high fever in children?", "What are the signs of a diabetes emergency?", "What to do if someone shows severe depression symptoms?", "What are the immediate actions for severe cold symptoms?"],
            "responses": ["For asthma attack: Use your inhaler, seek emergency medical help if necessary. For high fever: Keep the child cool and hydrated, consult a doctor. For diabetes emergency: Monitor blood sugar levels, use insulin if prescribed. For severe depression: Seek immediate professional help or contact a crisis hotline. For severe cold symptoms: Rest, hydrate, and seek medical advice if symptoms worsen."]
        }
    ]
}
